export const policyContent = `
# 腾讯设计用户服务协议

# 导言

欢迎您使用腾讯设计软件及服务（以下简称“本服务”）！

为使用本服务，您应当阅读、理解《腾讯设计用户服务协议》（以下简称“本协议”）、《腾讯设计隐私政策》。 请您仔细阅读并理解各条款内容，特别是免除或限制腾讯责任的条款、对用户权利进行限制的条款、约定争议解决方式和司法管辖的条款等。 限制、免除责任条款、法律适用和管辖条款或者其他涉及您重大权益的条款会以加粗或下划线等形式提示您重点注意。

腾讯设计是由深圳市腾讯计算机系统有限公司（以下简称“我们”或“腾讯”）提供的在线设计协作平台， 旨在为产品团队提供涵盖界面设计、交互原型制作、设计系统管理、团队协作审阅等一系列专业化服务，致力于打造高效、透明的新一代产品设计协作模式。

本协议由您与腾讯就您使用本服务而签署。您通过勾选、点击确认等同意行为或您使用本服务即视为您已仔细阅读并同意接受本协议的约束。如果您不同意本协议，您可停止使用本服务。

# 一、协议的范围

**1.1 协议适用主体范围**

本协议是您（以下也称 “用户 ”）与腾讯之间关于您使用本服务所订立的协议。

**1.2 协议关系及冲突条款**

本协议系为腾讯网站服务条款、用户规则中心、微信个人账号使用规范等协议的补充协议，是其不可分割的组成部分，与其共同构成双方之间的完整法律安排。本协议与上述内容存在冲突的，以本协议为准。

# 二、关于本软件及服务

**2.1 本服务的内容**

本服务内容是指腾讯基于本软件向用户提供的在线协作界面设计平台服务，腾讯可通过本软件和服务向用户提供矢量图形编辑、界面设计、交互原型制作、设计系统管理、团队协作审阅、组件库管理、设计文件分享、插件管理等等功能或服务。 

**2.2 本服务的形式**

我们可能采用网页、应用程序、微信小程序等形式，通过不断丰富的功能界面向用户提供服务。

**2.3 本服务许可的范围**

腾讯授予您一项不可转让、不可分许可、非排他性的许可，以按照本协议约定使用本服务。

# 三、用户个人信息保护

保护用户个人信息是腾讯的一项基本原则，腾讯将在法律允许的范围内按照本协议及《腾讯隐私政策》《腾讯设计隐私政策》的规定处理您的相关信息。
`;

export const privacyContent = `
# 腾讯设计隐私保护指引

# 引言

欢迎您使用腾讯设计软件及服务！

腾讯设计是由深圳市腾讯计算机系统有限公司（以下简称“我们”或“腾讯”）提供的在线设计协作平台，旨在为产品团队提供涵盖界面设计、交互原型制作、设计系统管理、团队协作审阅等一系列专业化服务。

腾讯设计尊重并保护每位使用腾讯设计服务的用户（以下简称“您”）的隐私并保护其个人信息。腾讯设计根据现行法规及政策，制定《腾讯设计隐私保护指引》（以下简称“本指引”）， 本指引向您说明腾讯设计会如何收集、保存、使用及对外使用您的信息。

1. 本指引适用于通过所有应用环境使用腾讯设计产品或服务。
2. **当前腾讯设计不提供给 14 周岁以下的未成年人使用，如果您未满 14 周岁，请立即停止使用。**
3. 我们对个人信息权益相关的重要条款采用“加黑并斜体”的书写方式进行特别提醒。

# 一、我们如何收集和使用您的个人信息

## （一）我们如何收集您的个人信息

**1.登录/注册场景**

腾讯设计支持个人用户使用微信号和邮箱登录，并绑定手机号使用。当您绑定手机号时，我们将通过发送短信验证码来验证您的身份是否有效。

我们会基于上述个人登录功能，使用第三方微信 SDK，并从第三方 SDK 中获取您的相关信息（如 openid、unionid、头像等）。

**2.创建团队与文件**

当您创建您的团队或设计稿时，您需要主动提供相关名称，并授权我们展示您的信息，以便于团队成员了解和查看。

## 二、我们如何存储您的个人信息

1. 我们会通过安全的方式存储您的信息，包括本地存储（例如利用网页进行数据缓存）、数据库和服务器日志。
2. 除非法律、行政法规另有规定外，我们仅在为您提供服务所必要的最短时间存储您登录场景的个人信息。

## 三、我们如何保护您的个人信息安全

我们已使用符合业界标准的安全防护措施保护用户提供的个人信息，防止数据遭到未经授权访问、公开披露、使用、修改、损毁、泄漏或丢失。
`;
